{
  "projects": [
    {
      "id": 1,
      "name": "Gerador de pedidos D2B",
      "thumb": "https://i.imgur.com/maDFVAL.png",
      "technologies": ["React", "TypeScript", "Tailwind", "Firebase"],
      "description": "Este aplicativo foi criado com a intenção de facilitar a criação de pedidos de compra para minha empresa"
    },
    {
      "id": 2,
      "name": "Movie Reviews",
      "thumb": "https://github.com/yagoramires/movie-reviews-project/raw/master/src/assets/readme.gif",
      "technologies": ["React", "Tailwind", "Firebase"],
      "description": "Este aplicativo foi criado para que as pessoas pudessem avaliar os filmes que assistiram"
    },
    {
      "id": 3,
      "name": "Fabrica Devs",
      "thumb": "https://i.imgur.com/maDFVAL.png",
      "technologies": ["React", "Tailwind", "Firebase"],
      "description": "Esta plataforma de videos foi criada para uma empresa com objetivo de oferecer um curso de programação"
    },
    {
      "id": 4,
      "name": "Hamburgueria Kenzie",
      "thumb": "https://i.imgur.com/maDFVAL.png",
      "technologies": ["React", "Styled-Components", "Firebase"],
      "description": "Este aplicativo foi criado para simular um app de delivery"
    },
    {
      "id": 5,
      "name": "Bikes Map",
      "thumb": "https://github.com/yagoramires/bike-map-react-project/raw/master/src/assets/readme.gif",
      "technologies": ["React", "TypeScript", "Tailwind", "Firebase"],
      "description": "Este aplicativo foi criado com a intenção de localizar as bicicletas disponiveis nos aplicativos de aluguel"
    },
    {
      "id": 6,
      "name": "Planets facts",
      "thumb": "https://github.com/yagoramires/planets-fact-project/raw/master/src/assets/readme.gif",
      "technologies": ["React"],
      "description": "Este aplicativo foi criado com a intenção de ilustrar os planetas do sistema solar"
    }
  ],
  "abilities": [
    {
      "title": "React",
      "description": "Tenho experiência em desenvolvimento de aplicativos web usando React, uma biblioteca JavaScript amplamente utilizada para construir interfaces de usuário. Com React, sou capaz de criar componentes reutilizáveis e escaláveis, tornando o processo de desenvolvimento mais eficiente. Além disso, tenho habilidade em integrar o React com outras bibliotecas e ferramentas para criar uma experiência de usuário excepcional."
    },
    {
      "title": "React Native com Expo",
      "description": "Também tenho experiência em desenvolvimento de aplicativos mobile usando React Native, um framework para criar aplicativos nativos para iOS e Android com uma única base de código. Com React Native, sou capaz de criar interfaces de usuário ricas e nativas usando JavaScript, o que acelera o processo de desenvolvimento. Além disso, tenho habilidade em trabalhar com recursos nativos, como a câmera e o GPS, para criar experiências de usuário personalizadas."
    },
    {
      "title": "Next JS",
      "description": "Possuo habilidades em Next.js, um framework React que permite a criação de aplicativos web com renderização no lado do servidor. Com o Next.js, sou capaz de construir aplicativos escaláveis e otimizados para a web, com uma arquitetura que permite o carregamento rápido de páginas e uma melhor experiência do usuário. Além disso, tenho habilidade em usar recursos avançados do Next.js, como roteamento dinâmico e geração estática de páginas."
    },
    {
      "title": "HTML, CSS & JS",
      "description": "Tenho habilidades em desenvolvimento web usando HTML, CSS e JavaScript. Com HTML, sou capaz de estruturar e criar conteúdo em páginas web, usando tags semânticas para melhorar a acessibilidade e SEO. Com CSS, sou capaz de estilizar e posicionar elementos na página, tornando-a visualmente atraente e responsiva em diferentes dispositivos. Com JavaScript, sou capaz de adicionar interatividade e dinamismo às páginas, com a criação de funções e eventos para manipulação do DOM e o uso de bibliotecas e frameworks para criar aplicativos mais complexos. Além disso, tenho habilidade em trabalhar com ferramentas e técnicas para otimização de performance e acessibilidade, garantindo uma melhor experiência do usuário."
    },
    {
      "title": "CSS Frameworks",
      "description": "Tenho habilidades em desenvolvimento web usando o Tailwind, um framework CSS que facilita a criação de estilos personalizados em páginas web. Com o Tailwind, sou capaz de criar classes de estilo reutilizáveis e aplicá-las em diferentes elementos HTML, permitindo um processo de desenvolvimento mais rápido e consistente. Além disso, tenho habilidade em usar as ferramentas do Tailwind para personalizar o estilo de acordo com as necessidades do projeto, como cores, tamanhos e espaçamentos. Também tenho experiência em desenvolvimento web usando Styled Components, uma biblioteca JavaScript para criar estilos em componentes React. Com o Styled Components, sou capaz de criar estilos encapsulados e reutilizáveis que são aplicados dinamicamente aos componentes React, tornando o código mais modular e fácil de manter. Além disso, tenho habilidade em usar recursos avançados do Styled Components, como temas e props, para criar estilos personalizados e responsivos para diferentes dispositivos."
    },
    {
      "title": "API Rest",
      "description": "Tenho habilidades em consumir APIs de serviços web, permitindo a integração de dados e funcionalidades de outros aplicativos em projetos que estou trabalhando. Sou capaz de usar bibliotecas e ferramentas para consumir APIs RESTful, como axios e fetch, e integrá-las em aplicativos web ou móveis usando React e React Native. Além disso, tenho habilidade em trabalhar com documentação de APIs para entender como fazer solicitações e receber dados em formato JSON."
    }
  ],
  "education": [
    {
      "id": 2,
      "name": "Next.js e React",
      "label": "Udemy - Cod3r Cursos Online",
      "date": "2022",
      "description": "Curso focado em Next JS. Carga horária 28h. "
    },
    {
      "id": 3,
      "name": "React do Zero a Maestria",
      "label": "Udemy - Matheus Battisti ",
      "date": "2022",
      "description": "Curso focado em react para aprofundar meus conhecimentos e conhecer novas funcionalidades. Carga horária 28h."
    },
    {
      "id": 4,
      "name": "HTML, CSS, JavaScript, GitHub, React",
      "label": "Frontbase - Gabriel Salvador",
      "date": "2022",

      "description": "Bootcamp de desenvolvimento para aprimorar e solidificar meus conhecimentos no básico do front-end. Carga horária de 32h."
    },
    {
      "id": 5,
      "name": "JavaScript e TypeScript do básico ao avançado",
      "label": "Udemy - Luiz Otávio Miranda",
      "date": "2022",

      "description": "Curso para aprimorar meus conhecimentos em JavaScript. Carga horária 44h."
    },

    {
      "id": 6,
      "name": "Discover",
      "label": "RocketSeat",
      "date": "2021",
      "description": "Curso de introdução ao desenvolvimento web, introduzindo HTML, CSS e Javascript. Com carga horaria de 50h."
    },
    {
      "id": 1,
      "name": "Ciências Contábeis",
      "label": "Universidade do Estado do Rio de Janeiro - UERJ",
      "date": "2015-2021",
      "description": "Sou formado em contabilidade, porém apaixonado por programação."
    }
  ],
  "experience": [
    {
      "id": 1,
      "name": "D2B Representações",
      "label": "Assistente administrativo de TI",
      "date": "Fev 2021 - Atualmente",
      "description": "Atuando na área de TI, sou responsável por desenvolver soluções relacionadas a automações de processos e também manutenção dessas soluções utilizando Python. Também faço a manutenção e automação de planillhas utilizando VBA. Atualmente estou desenvolvendo um projeto como desenvolvedor para a a empresa, no qual consiste em uma plataforma de  pedidos online, utilizando React e Firebase."
    },
    {
      "id": 2,
      "name": "DATAPREV",
      "label": "Estagiário",
      "date": "Jan 2019 - Jun 2021",
      "description": "Atuando na área contábil, desenvolvi soluções de automação por meio de planilhas para suportar às análises das contas contábeis. Efetuei lançamentos contábeis, realizei a conciliação e análise de contas patrimoniais, como por exemplo: retenção de ISS e INSS na fonte de fornecedores, ISS sobre o faturamento, depósitos judiciais a restituir e aluguéis a pagar. Além disso, fui usuário dos sistemas ERP Protheus e FLUIG (TOTVs)."
    }
  ]
}
